#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.fiap_burger_eks: Reading...
data.terraform_remote_state.fiap_burger_identity: Reading...
data.terraform_remote_state.fiap_burger_eks: Read complete after 1s
data.terraform_remote_state.fiap_burger_identity: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_apigatewayv2_api.fiap_burger will be created
  + resource "aws_apigatewayv2_api" "fiap_burger" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "fiap_burger"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_integration.fiap_burger_identity_integration will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_identity_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:287574492696:function:fiap_burger_identity/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.proxy_handler will be created
  + resource "aws_apigatewayv2_route" "proxy_handler" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /identity"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.dev will be created
  + resource "aws_apigatewayv2_stage" "dev" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "dev"
      + tags_all      = (known after apply)
    }

  # aws_lambda_permission.api_gtw will be created
  + resource "aws_lambda_permission" "api_gtw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fiap_burger_identity"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + apigateway_execution_arn = (sensitive value)
  + apigateway_id            = (sensitive value)
  + apigateway_url           = (sensitive value)

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - API Gateway`*